# GridBubbleLinePen Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridBubbleLinePen Property
ParameterTypeId Class See Also
---
"Bubble Weight Number\n"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridBubbleLinePen { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridBubbleLinePen As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridBubbleLinePen {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace